In [2]:
# importing dependencies

import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings("ignore")

# for connection and data loading to Mysql
import pymysql
from sqlalchemy import create_engine

### Data loading

In [3]:
sdf = pd.read_csv('Walmart.csv')
df = sdf.copy()

### Data exploration and cleaning

- There are same number of rows missing in 'Quantity' and 'unit_price' column 31 rows
- the data type for unit_price and data columns are not correct additionally the unit_price column has "$" symbol which is not correct
- Also the dataset has 51 duplicate columns

In [4]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

In [6]:
df.duplicated().sum()

51

In [7]:
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

- Removing duplicate rows

In [8]:
df.drop_duplicates(inplace=True)

In [9]:
print(df.duplicated().sum())
print(df.shape)

0
(10000, 11)

- Let's remove the dollar symbol from the "unit_price", change the data type as int64

In [10]:
df.head(1)

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48

In [11]:
df['unit_price'] = df['unit_price'].str.replace('$', '', regex=False)

In [12]:
df.head(1)

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48

In [13]:
df['unit_price'] = df['unit_price'].astype(float)

- Filling missing values with median() in "unit_price" column as well as "quantity" column

In [14]:
median_value_unit_price = df['unit_price'].median()
df['unit_price'].fillna(median_value_unit_price, inplace=True)
median_value_quantity = df['quantity'].median()
df['quantity'].fillna(median_value_quantity, inplace=True)

In [15]:
df.sample()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
7747,7748,WALM074,Weslaco,Fashion accessories,75.0,3.0,15/11/22,17:23:00,Credit card,7.0,0.33

In [16]:
df['total'] = df['unit_price'] * df['quantity']
df['net_profit'] = df['profit_margin']*df['total']

In [17]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total,net_profit
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48,522.83,250.9584
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48,76.40,36.6720
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33,324.31,107.0223
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33,465.76,153.7008
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48,604.17,290.0016

In [18]:
df.columns = df.columns.str.lower()
df.columns

Index(['invoice_id', 'branch', 'city', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin', 'total',
       'net_profit'],
      dtype='object')

- changes and extraction of unsefull information from "Date" column

In [19]:
df['date'] = pd.to_datetime(df['date'])
df['year'] = df['date'].dt.year
df['month'] = df['date'].dt.month
df['ym'] = df['year'].astype(str) + '-' + df['month'].astype(str)
df['day'] = df['date'].dt.day_name()
df['quarter'] = df['date'].dt.quarter
df['is_weekend'] = df['date'].dt.dayofweek >=5

In [20]:
df.head(3)

,invoice_id,branch,city,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total,net_profit,year,month,ym,day,quarter,is_weekend
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,2019-05-01,13:08:00,Ewallet,9.1,0.48,522.83,250.9584,2019,5,2019-5,Wednesday,2,False
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,2019-08-03,10:29:00,Cash,9.6,0.48,76.40,36.6720,2019,8,2019-8,Saturday,3,True
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,2019-03-03,13:23:00,Credit card,7.4,0.33,324.31,107.0223,2019,3,2019-3,Sunday,1,True

- changes and extraction of usefull information from "Time" column

In [21]:
df['hour'] = pd.to_datetime(df['time'], format='%H:%M:%S').dt.hour
df['minute'] = pd.to_datetime(df['time'], format='%H:%M:%S').dt.minute
df['second'] = pd.to_datetime(df['time'], format='%H:%M:%S').dt.second

def time_of_day(hour):
    if 5 <= hour < 12:
        return 'Morning'
    elif 12 <= hour < 17:
        return 'Afternoon'
    elif 17 <= hour < 21:
        return 'Evening'
    else:
        return 'Night'

df['hour'] = pd.to_datetime(df['time'], format='%H:%M:%S').dt.hour
df['time_of_day'] = df['hour'].apply(time_of_day)

### Connecting and importing data to MySQL

In [ ]:
engine_mysql = create_engine("mysql+pymysql://****:****@localhost:****/walmart_db")

try:
    engine_mysql
    print("Connected to mysql")
except:
    print("Unable to connect")

In [ ]:
df.to_sql(name='walmart', con = engine_mysql, if_exists='replace', index=False)

### Extra analysis

- 98 --> Cities
- 100 --> Branches
- 6 --> categories
- "Waxahachie", "Weslaco"  are the two cities with 2 branches each and rest all cities have 1 branch in it.
- "Victoria", "Tyler" are the two cities which has 3 cateogries each in thier branches
- [Farmers Branch, Houston, Garland, Huntsville, Mission, La Porte, Rowlett, Brownwood, Baytown, Amarillo, Frisco, Sherman, Weatherford, Pasadena, El Paso, Lake Jackson] are the cities with 4 categories in their branches
-

In [24]:
df[df['city'] == 'Waxahachie']['branch'].unique()

array(['WALM087', 'WALM055'], dtype=object)

In [25]:
for i in df['city'].unique():
    if df[df['city'] == i]['branch'].nunique() != 1:
        print(i)
    else:
        pass

Waxahachie
Weslaco

In [26]:
l=[]
for i in df['city'].unique():
    if df[df['city'] == i]['category'].nunique() == 3:
        print(df[df['city'] == i]['category'].unique())
        l.append(i)
    else:
        pass
print(len(l))

['Electronic accessories' 'Fashion accessories' 'Home and lifestyle']
['Electronic accessories' 'Fashion accessories' 'Home and lifestyle']
2

In [27]:
temp = pd.DataFrame(df[df['ym'].str.contains('2020')]['ym'].unique())

In [ ]:
df['branch']